package org.example.core.primitives;


public class TestIfElse {
    public static void main(String[] args) {
        //Напиши метод, который будет принимать целое число и выводить на экран, является ли это число четным или нечетным.
        int number = 4; // Замените на любое число для проверки
        // твой код здесь

        // Напиши программу, которая принимает два числа и выводит на экран сообщение о том, какое число больше, или что они равны.
        int a = 5;
        int b = 10;
// твой код здесь


        // Имеется магазин, который предоставляет скидку 10% на заказы стоимостью более 1000 рублей.
        // Напишите программу, которая будет принимать стоимость заказа и выводить стоимость с учетом скидки, если она применима.
        double priceMax = 1200;
        double priceMin = 900;
// твой код здесь


        // Напишите программу, которая будет определять
        // возрастную категорию по введенному возрасту: дети (0-12), подростки (13-19), взрослые (20-65), пенсионеры (66 и старше).
        int age = 25;
        // твой код здесь
    }
}

