package org.example.core.for_while;

import java.util.Scanner;

public class TestWhileFor {
    public static void main(String[] args) {
       // Используйте цикл for для печати чисел от 1 до 100.
        //твой код здесь

        //---------------
        //Найти сумму первых N натуральных чисел
        //Цель: Используйте цикл while для вычисления суммы первых N натуральных чисел, где N задается пользователем.

        int sum = 0;
        int n = 10;
        int i = 1;
//твой код здесь

        //---------------
        //Проверка на простое число
        //Цель: Используйте цикл for для проверки, является ли число простым.
        //Простое число — это число, которое делится нацело только на 1 и на само себя.

        int num = 29;
        boolean isPrime = true;
//твой код здесь
        //-----------
        //Повторяющийся ввод данных до получения корректного значения
        //Цель: Используйте цикл do-while для запроса у пользователя ввода числа.
        //Цикл должен повторяться, пока пользователь не введет число в допустимом диапазоне

        Scanner scanner = new Scanner(System.in);
        int number;
        //твой код здесь
    }
}
