package org.example.core.massive;

/**
 * для каждой задачи создавать новые массивы, результат вывести в консоль.
 */
public class TaskArray {
    public static void main(String[] args) {
        //Создайте массив из 10 элементов и заполните его числами от 1 до 10.
        //твой код здесь

        // Найдите максимальный элемент в массиве. (создать любой массив с рандомными числами)
        //твой код здесь

        //Создайте программу, которая обращает массив (меняет элементы местами с начала до конца).
        // твой код здесь

        //Вычислите среднее значение всех элементов массива.
        //твой код здесь
    }
}
